Autodesk.Revit.DB.ScheduleDefinition.RemoveEmbeddedSchedule
Removes the embedded ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ScheduleDefinition does not have an embedded ScheduleDefinition.
Since:
2013

Autodesk.Revit.DB.ScheduleDefinition.AddEmbeddedSchedule(Autodesk.Revit.DB.ElementId)
Adds an embedded ScheduleDefinition.
categoryId:
The category ID of elements to display in the embedded schedule.
Throws Autodesk.Revit.Exceptions.ArgumentException:
categoryId is not the ID of a category that can be used for an embedded
ScheduleDefinition in this ScheduleDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This ScheduleDefinition is not a kind of schedule that supports adding an embedded
ScheduleDefinition.
-or-
This ScheduleDefinition already has an embedded ScheduleDefinition.
Since:
2013